angular.module('MyApp')
    .controller('market', ['$scope', function ($scope) {

    $scope.myData = [
        {
            "P כמות ביקוש":"16",
            "P מחיר ביקוש": "80",
            "P מחיר תיאורטי": "82",
            "P מחיר היצע": "84",
            "P כמות היצע": "2",
            "מחיר מימוש": "001 WK2",
            "C כמות היצע":"1",
            "C מחיר היצע": "5600",
            "C מחיר תיאורטי": "5301",
            "C מחיר ביקוש": "4390",
            "C כמות ביקוש": "3"
        },
        {
            "P כמות ביקוש":"16",
            "P מחיר ביקוש": "80",
            "P מחיר תיאורטי": "82",
            "P מחיר היצע": "84",
            "P כמות היצע": "2",
            "מחיר מימוש": "001 WK2",
            "C כמות היצע":"1",
            "C מחיר היצע": "5600",
            "C מחיר תיאורטי": "5301",
            "C מחיר ביקוש": "4390",
            "C כמות ביקוש": "3"
        },
        {
            "P כמות ביקוש":"16",
            "P מחיר ביקוש": "80",
            "P מחיר תיאורטי": "82",
            "P מחיר היצע": "84",
            "P כמות היצע": "2",
            "מחיר מימוש": "001 WK2",
            "C כמות היצע":"1",
            "C מחיר היצע": "5600",
            "C מחיר תיאורטי": "5301",
            "C מחיר ביקוש": "4390",
            "C כמות ביקוש": "3"
        }
    ];
}])